`terraform plan`
<details>

```
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.members.github_membership.member["AstartetraP"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "AstartetraP"
    }

  # module.members.github_membership.member["alcedo-taku"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "alcedo-taku"
    }

  # module.members.github_membership.member["anko9801"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "anko9801"
    }

  # module.members.github_membership.member["dye8128"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "dye8128"
    }

  # module.members.github_membership.member["katsudontech"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "katsudontech"
    }

  # module.members.github_membership.member["kavos113"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "kavos113"
    }

  # module.members.github_membership.member["superharuma"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "superharuma"
    }

  # module.members.github_membership.member["the-edible-pan"] will be created
  + resource "github_membership" "member" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "the-edible-pan"
    }

  # module.hackathon.module.h24s_children_teams["h24s_04"].github_team_members.team_members will be updated in-place
  ~ resource "github_team_members" "team_members" {
        id      = "10301520"
        # (1 unchanged attribute hidden)

      - members {
          - role     = "maintainer" -> null
          - username = "Hyde616" -> null
        }
      + members {
          + role     = "maintainer"
          + username = "hyde616"
        }

        # (4 unchanged blocks hidden)
    }

  # module.hackathon.module.h24s_children_teams["h24s_14"].github_team_members.team_members will be updated in-place
  ~ resource "github_team_members" "team_members" {
        id      = "10301517"
        # (1 unchanged attribute hidden)

      + members {
          + role     = "maintainer"
          + username = "reiroop"
        }

        # (5 unchanged blocks hidden)
    }

  # module.hackathon.module.h24s_children_teams["h24s_15"].github_team.team will be created
  + resource "github_team" "team" {
      + create_default_maintainer = false
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "h24s_15"
      + node_id                   = (known after apply)
      + parent_team_id            = "10278337"
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # module.hackathon.module.h24s_children_teams["h24s_15"].github_team_members.team_members will be created
  + resource "github_team_members" "team_members" {
      + id      = (known after apply)
      + team_id = (known after apply)

      + members {
          + role     = "maintainer"
          + username = "AstartetraP"
        }
      + members {
          + role     = "maintainer"
          + username = "inutamago-dogegg"
        }
      + members {
          + role     = "maintainer"
          + username = "katsudontech"
        }
      + members {
          + role     = "maintainer"
          + username = "the-edible-pan"
        }
    }

  # module.hackathon.module.h24s_children_teams["h24s_16"].github_team_members.team_members will be updated in-place
  ~ resource "github_team_members" "team_members" {
        id      = "10301522"
        # (1 unchanged attribute hidden)

      + members {
          + role     = "maintainer"
          + username = "ayanakm"
        }

        # (5 unchanged blocks hidden)
    }

  # module.hackathon.module.h24s_children_teams["h24s_18"].github_team_members.team_members will be updated in-place
  ~ resource "github_team_members" "team_members" {
        id      = "10309588"
        # (1 unchanged attribute hidden)

      - members {
          - role     = "member" -> null
          - username = "wakky-alcedo" -> null
        }
      + members {
          + role     = "member"
          + username = "alcedo-taku"
        }
      + members {
          + role     = "member"
          + username = "shushuya0210"
        }
      + members {
          + role     = "member"
          + username = "stamtam"
        }

        # (3 unchanged blocks hidden)
    }

  # module.hackathon.module.h24s_children_teams["h24s_24"].github_team_members.team_members will be updated in-place
  ~ resource "github_team_members" "team_members" {
        id      = "10312429"
        # (1 unchanged attribute hidden)

      - members {
          - role     = "member" -> null
          - username = "YuHima03" -> null
        }
      + members {
          + role     = "member"
          + username = "yuhima03"
        }

        # (4 unchanged blocks hidden)
    }

  # module.hackathon.module.h24s_children_teams["h24s_25"].github_team_members.team_members will be updated in-place
  ~ resource "github_team_members" "team_members" {
        id      = "10312428"
        # (1 unchanged attribute hidden)

      + members {
          + role     = "member"
          + username = "Silent-Clubstep"
        }

        # (4 unchanged blocks hidden)
    }

  # module.hackathon.module.h24s_children_teams["h24s_33"].github_team.team will be created
  + resource "github_team" "team" {
      + create_default_maintainer = false
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "h24s_33"
      + node_id                   = (known after apply)
      + parent_team_id            = "10278337"
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # module.hackathon.module.h24s_children_teams["h24s_33"].github_team_members.team_members will be created
  + resource "github_team_members" "team_members" {
      + id      = (known after apply)
      + team_id = (known after apply)

      + members {
          + role     = "maintainer"
          + username = "anko9801"
        }
      + members {
          + role     = "maintainer"
          + username = "dye8128"
        }
      + members {
          + role     = "maintainer"
          + username = "kavos113"
        }
      + members {
          + role     = "maintainer"
          + username = "ramdos0207"
        }
      + members {
          + role     = "maintainer"
          + username = "superharuma"
        }
    }

  # module.hackathon.module.h24s_parent_team.github_team_members.team_members will be updated in-place
  ~ resource "github_team_members" "team_members" {
        id      = "10278337"
        # (1 unchanged attribute hidden)

      - members {
          - role     = "member" -> null
          - username = "YuHima03" -> null
        }
      - members {
          - role     = "member" -> null
          - username = "wakky-alcedo" -> null
        }
      + members {
          + role     = "member"
          + username = "AstartetraP"
        }
      + members {
          + role     = "member"
          + username = "H1rono"
        }
      + members {
          + role     = "member"
          + username = "Silent-Clubstep"
        }
      + members {
          + role     = "member"
          + username = "alcedo-taku"
        }
      + members {
          + role     = "member"
          + username = "anko9801"
        }
      + members {
          + role     = "member"
          + username = "ayanakm"
        }
      + members {
          + role     = "member"
          + username = "dye8128"
        }
      + members {
          + role     = "member"
          + username = "hyde616"
        }
      + members {
          + role     = "member"
          + username = "inutamago-dogegg"
        }
      + members {
          + role     = "member"
          + username = "katsudontech"
        }
      + members {
          + role     = "member"
          + username = "kavos113"
        }
      + members {
          + role     = "member"
          + username = "ramdos0207"
        }
      + members {
          + role     = "member"
          + username = "reiroop"
        }
      + members {
          + role     = "member"
          + username = "shushuya0210"
        }
      + members {
          + role     = "member"
          + username = "stamtam"
        }
      + members {
          + role     = "member"
          + username = "superharuma"
        }
      + members {
          + role     = "member"
          + username = "the-edible-pan"
        }
      + members {
          + role     = "member"
          + username = "yuhima03"
        }

        # (50 unchanged blocks hidden)
    }

Plan: 12 to add, 7 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>